In [127]:
# Importando as bibliotecas que serão utilizadas. 
import numpy as np
import pandas as pd
from pandas_datareader import data as wb
import datetime as dt

In [128]:
# Importando os dados do aquivo "IBOVDiA3.csv".
dados = pd.read_csv('IBOVDiA3.csv')                      
display(dados)

   Unnamed: 0 Unnamed: 1        CD
0       RRRP3        .SA  RRRP3.SA
1       ALPA4        .SA  ALPA4.SA
2       ABEV3        .SA  ABEV3.SA
3       AMER3        .SA  AMER3.SA
4       ASAI3        .SA  ASAI3.SA
..        ...        ...       ...
86      VALE3        .SA  VALE3.SA
87      VIIA3        .SA  VIIA3.SA
88      VBBR3        .SA  VBBR3.SA
89      WEGE3        .SA  WEGE3.SA
90      YDUQ3        .SA  YDUQ3.SA

[91 rows x 3 columns]

In [309]:
# Selecinando os tickers das ações. (Que se localizam na quarta coluna).
tickers = dados["CD"]

# Informando a data inicial e final.
data_inicial = dt.datetime(2022,5,30)
data_final   = dt.datetime(2022,6,3)

# Jogando os dados para um lista.
lista = [ "BBDC4.SA","BBAS3.SA", "ITUB4.SA", "SANB4.SA", "VALE3.SA", "VIIA3.SA", "YDUQ3.SA"]

# Buscando a cotação das ações (tickers) importadas via "yahoo finance,".
df = wb.DataReader (lista, "yahoo", data_inicial, data_final) 
df

Attributes  Adj Close                                                       \
Symbols      BBDC4.SA   BBAS3.SA   ITUB4.SA   SANB4.SA   VALE3.SA VIIA3.SA
Date
2022-05-30  20.360788  36.070000  25.902514  17.690001  86.650002     3.17
2022-05-31  20.480677  36.619999  26.142351  17.540001  86.209999     3.14
2022-06-01  20.111025  36.689999  25.780001  17.370001  88.239998     3.09
2022-06-02  20.030001  36.720001  25.889999  17.070000  89.900002     3.19
2022-06-03  19.750000  36.070000  25.629999  16.840000  88.750000     3.13

Attributes                 Close                        ...       Open  \
Symbols      YDUQ3.SA   BBDC4.SA   BBAS3.SA   ITUB4.SA  ...   VALE3.SA
Date                                                    ...
2022-05-30  16.540001  20.379999  36.070000  25.920000  ...  86.279999
2022-05-31  16.180000  20.500000  36.619999  26.160000  ...  87.220001
2022-06-01  16.450001  20.129999  36.689999  25.780001  ...  86.190002
2022-06-02  16.650000  20.030001  36.720001  25.889999  ...  90.000000
2022-06-03  15.700000  19.750000  36.070000  25.629999  ...  89.500000

Attributes                          Volume                                    \
Symbols    VIIA3.SA   YDUQ3.SA    BBDC4.SA    BBAS3.SA    ITUB4.SA  SANB4.SA
Date
2022-05-30     3.29  17.379999  16964100.0  25708100.0  17951900.0   19400.0
2022-05-31     3.18  16.459999  55770400.0  33694400.0  66207900.0   34100.0
2022-06-01     3.14  16.270000  35754500.0  13474800.0  28494800.0   90900.0
2022-06-02     3.10  16.650000  27083600.0   9551600.0  17934600.0  137800.0
2022-06-03     3.14  16.639999  12767100.0   6629900.0  14593800.0   63600.0

Attributes
Symbols       VALE3.SA    VIIA3.SA   YDUQ3.SA
Date
2022-05-30  16147900.0  26389300.0  1570300.0
2022-05-31  41369800.0  20199300.0  2440300.0
2022-06-01  26258900.0  25463200.0  3147900.0
2022-06-02  25142400.0  44899100.0  1730200.0
2022-06-03  14188800.0  24280600.0  1288600.0

[5 rows x 42 columns]

In [310]:
# Calculando a variação diária da ação usando a função "pct_change() ".
df['Close'] = df['Close'].pct_change()         

# Selecionando a coluna "Close" e multiplicando por 100 as cotações da linha 01.
# Colocando 2 colchetes, cria-se um data-frame. Essa função ocorre graças ao pandas. 
test = df[['Close']].round(4)*100    
test.rename_axis('dataaaaa')

Attributes    Close
Symbols    BBDC4.SA BBAS3.SA ITUB4.SA SANB4.SA VALE3.SA VIIA3.SA YDUQ3.SA
dataaaaa
2022-05-30      NaN      NaN      NaN      NaN      NaN      NaN      NaN
2022-05-31     0.59     1.52     0.93    -0.85    -0.51    -0.95    -2.18
2022-06-01    -1.80     0.19    -1.45    -0.97     2.35    -1.59     1.67
2022-06-02    -0.50     0.08     0.43    -1.73     1.88     3.24     1.22
2022-06-03    -1.40    -1.77    -1.00    -1.35    -1.28    -1.88    -5.71

In [311]:
# Buscando os dados da linha 01.
ibov = test.iloc[1].round(3)

# sorted é uma função usada para colocar em ordem crescente dos dados.
test = sorted (ibov)
test

[-2.18, -0.95, -0.85, -0.51, 0.59, 0.93, 1.52]

In [312]:
test = pd.DataFrame(test)
test.rename (columns= {0 : "Cotação"}, inplace = True)
test

   Cotação
0    -2.18
1    -0.95
2    -0.85
3    -0.51
4     0.59
5     0.93
6     1.52

In [240]:
test.to_excel('ibov_cotação.xlsx')       # Exportando via arquivo xlsx.

In [8]:
# .index

In [296]:
df = pd.DataFrame([[10,20], 
                   [12,30]]
                 )


df = df.pct_change()
df*100

      0     1
0   NaN   NaN
1  20.0  50.0

In [297]:
df.rename (columns= {"data" : "carro",
                    0 : "ano", 
                    1 : 80})

   ano   80
0  NaN  NaN
1  0.2  0.5

In [298]:
df.rename_axis('names')

         0    1
names
0      NaN  NaN
1      0.2  0.5